week7/w7d4/news_reader/app/controllers/api/entries_controller.rb

  def index
    sleep 3
    feed = Feed.find(params[:feed_id])
---
SELECT "feeds".* FROM "feeds" WHERE "feeds"."id" = $1 LIMIT 1  [["id", "1"]]