week7/w7d4/news_reader/app/controllers/api/feeds_controller.rb

  def index
    sleep 3
    render :json => Feed.all
---
SELECT "feeds".* FROM "feeds"

  def destroy
    feed = Feed.find(params[:id])
    feed.destroy!
---
SELECT "feeds".* FROM "feeds" WHERE "feeds"."id" = $1 LIMIT 1  [["id", "1"]]
DELETE FROM "feeds" WHERE "feeds"."id" = $1  [["id", 1]]